2309/src/InformationRegisters/productsMapping/productsMapping.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>productsMapping</name>
  <resources>
    <name>registrationDate</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>product</name>
    <type>
      <types>CatalogRef.products</types>
    </type>
  </dimensions>
  <dimensions>
    <name>entryType</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>uid</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

2309/src/InformationRegisters/productsMapping/ManagerModule.bsl
Function attributesStructure(requestName) Export
	
	attributesTable = DataLoad.getValueTable();
	attributesTableForNewItem = DataLoad.getValueTable();
		
	DataLoad.addRowInAttributesTable(attributesTable, "product", "product", "ref");
	DataLoad.addRowInAttributesTable(attributesTable, "uid", "uid", "string");
	DataLoad.addRowInAttributesTable(attributesTable, "entryType", "entryType", "string");
	
	mdStruct = New Structure();	
	mdStruct.Insert("product", New Structure("products", "uid"));
	
	actType = ?(requestName = "deleteproductmapping", "delete", "write"); 
	
	Return New Structure("fillHolding, mdObjectName, mdType, actType, attributesTable, attributesTableForNewItem, mdStruct", False, "productsMapping", "informationRegister", actType, attributesTable, attributesTableForNewItem, mdStruct);

EndFunction
